{
    "repo": {
        "name": "akeyless-client-commons",
        "source_default_branch": "main"
    },
    "file_name": "InternationalPhonePicker.tsx",
    "source": {
        "file_path": "components/forms/ModularForm/InternationalPhonePicker.tsx",
        "commit_sha": "844185137ce1390e1c325518f954aaf0e22f09ff",
        "generated_at_iso": "2026-02-12T00:00:00.000Z",
        "language": "tsx",
        "framework_tags": ["react"],
        "link_to_github": "https://github.com/akeylesspro/akeyless-client-commons/blob/844185137ce1390e1c325518f954aaf0e22f09ff/src/components/forms/ModularForm/InternationalPhonePicker.tsx",
        "link_to_nx_kb": "/repos/akeyless-client-commons/docs/components/forms/ModularForm/InternationalPhonePicker.tsx.json"
    },
    "summary": {
        "purpose": "Implements an international phone number input component with country flag selector, built on top of react-phone-number-input.",
        "problem_solved": "Provides a phone number input with international dialing code support, country flag dropdown, automatic phone number formatting, optional controlled/uncontrolled value modes, Enter key handler, auto-focus capability, and integration with the ModularForm label system."
    },
    "dependencies": {
        "external": [
            { "name": "react", "usage": "forwardRef, useEffect, useMemo, useRef, useState for component state, refs, and forwarding" },
            { "name": "react-phone-number-input", "usage": "Core phone input component (RPNInput.default), Country type, FlagProps type, getCountryCallingCode, and flags for country flag SVGs" },
            { "name": "lucide-react", "usage": "ChevronDown icon for country selector dropdown indicator, Phone icon as fallback when no flag is available" }
        ],
        "internal": [
            {
                "name": "Input",
                "resolved_path": "components/ui/input",
                "link_to_nx_kb": "/repos/akeyless-client-commons/docs/components/ui/input.tsx.json"
            },
            {
                "name": "cn",
                "resolved_path": "lib/utils",
                "link_to_nx_kb": "/repos/akeyless-client-commons/docs/lib/utils.ts.json"
            },
            {
                "name": "InternationalInputProps",
                "resolved_path": "types/index",
                "link_to_nx_kb": "/repos/akeyless-client-commons/docs/types/index.ts.json"
            },
            {
                "name": "ElementLabel",
                "resolved_path": "components/forms/ModularForm/formElements",
                "link_to_nx_kb": "/repos/akeyless-client-commons/docs/components/forms/ModularForm/formElements.tsx.json"
            }
        ]
    },
    "exports": [
        {
            "name": "InternationalPhonePicker",
            "kind": "component",
            "is_default": true,
            "description": "An international phone number input component with country flag selector, automatic formatting, and ModularForm-compatible label rendering."
        }
    ],
    "symbols": [
        {
            "id": "component_international_phone_picker",
            "kind": "component",
            "name": "InternationalPhonePicker",
            "signature": "({ setPhoneValue, phoneValue, placeholder, className, containerClassName, defaultCountry, flagContainerClassName, inputClassName, defaultValue, name, style, onEnter, labelContent, labelClassName, required, direction, defaultFocus, labelsCommonClassName, elementsCommonClassName, minLength, countries, disabled }: InternationalInputProps) => JSX.Element",
            "description": "Main international phone picker component. Supports both controlled mode (via setPhoneValue/phoneValue props) and uncontrolled mode (via internal tempPhoneValue state with hidden input for form submission). Defaults to Israel (IL) country code. Merges user-provided countries with a default set (US, IL, NG, TH). Renders an optional label via ElementLabel when labelContent is provided. Auto-focuses the phone input by default. Stores the phone value in a hidden input element for form submission.",
            "details": {
                "rendered_ui_description": "An optional label followed by a phone input row containing a country flag dropdown selector on the left (with chevron indicator) and a text input field on the right for entering the phone number. The input has a rounded border with shadow styling and always renders left-to-right."
            }
        },
        {
            "id": "component_phone_input",
            "kind": "component",
            "name": "PhoneInput",
            "signature": "forwardRef<HTMLInputElement, React.ComponentProps<'input'> & { defaultFocus: boolean; disabled: boolean }>((props, ref) => JSX.Element)",
            "description": "A forwardRef wrapper around the shared Input UI component used as the text input for phone number entry. Handles auto-focus on mount when defaultFocus is true. Manages dual ref (internal inputRef for focus and forwarded ref for react-phone-number-input).",
            "details": {
                "rendered_ui_description": "A styled text input field with left border removed (rounded on the right side only) to visually attach to the country selector. Gains focus automatically by default on mount."
            }
        },
        {
            "id": "component_country_select",
            "kind": "component",
            "name": "CountrySelect",
            "signature": "({ disabled, value, onChange, options, className }: CountrySelectProps) => JSX.Element",
            "description": "A custom country selector component for the phone input. Renders a styled container with the current country flag and a chevron down icon, overlaid with a transparent native HTML select element for accessibility and mobile compatibility. Filters out options without a country value and displays country name with calling code.",
            "details": {
                "rendered_ui_description": "A rounded left-side button showing the selected country flag and a small down chevron icon. An invisible native select element overlays the button for actual interaction, ensuring accessibility and native mobile picker support."
            }
        },
        {
            "id": "component_flag_component",
            "kind": "component",
            "name": "FlagComponent",
            "signature": "({ country, countryName }: RPNInput.FlagProps) => JSX.Element",
            "description": "Renders the SVG flag for a given country code from the react-phone-number-input flags package. Falls back to a Phone icon from lucide-react when no flag is available for the country.",
            "details": {
                "rendered_ui_description": "A small (20px wide) rounded flag image, or a phone icon fallback if the country flag is unavailable."
            }
        },
        {
            "id": "type_country_select_props",
            "kind": "type",
            "name": "CountrySelectProps",
            "signature": "type CountrySelectProps = { disabled?: boolean; className?: string; value: RPNInput.Country; onChange: (value: RPNInput.Country) => void; options: { label: string; value: RPNInput.Country | undefined }[] }",
            "description": "Props type for the CountrySelect component defining the disabled state, custom className, current country value, change handler, and array of country options with labels."
        }
    ],
    "quality": {
        "generation_confidence": "high",
        "known_gaps": []
    }
}